
**Initializing the backend...**

```diff
+Successfully configured the backend "s3"! Terraform will automatically
+use this backend unless the backend configuration changes.
```

**Initializing provider plugins...**
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (terraform-providers/aws) 2.26.0...

```diff
+Terraform has been successfully initialized!
```
**Refreshing Terraform state in-memory prior to plan...**
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

**aws_iam_role.gen_index_role: Refreshing state... [id=s3pypi-gen-index]**
**aws_sns_topic.rebuild_root_topic: Refreshing state... [id=arn:aws:sns:us-east-1:385198630581:s3pypi-rebuild-root]**
**aws_iam_role.gen_proj_index_role: Refreshing state... [id=s3pypi-gen-proj-index]**
**aws_s3_bucket.artifact_bucket: Refreshing state... [id=s3pypi-artifacts]**
**aws_s3_bucket.index_bucket: Refreshing state... [id=s3pypi-index]**
**aws_iam_role_policy_attachment.gen_index_basic_lambda: Refreshing state... [id=s3pypi-gen-index-20190831224431225500000001]**
**aws_iam_role_policy_attachment.gen_proj_index_basic_lambda: Refreshing state... [id=s3pypi-gen-proj-index-20190831224431601700000002]**
**aws_iam_policy.generate_base_index: Refreshing state... [id=arn:aws:iam::385198630581:policy/s3pypi-generate-base-index]**
**aws_lambda_function.gen_proj_index_lambda: Refreshing state... [id=s3pypi-gen-proj-index]**
**aws_lambda_function.gen_index_lambda: Refreshing state... [id=s3pypi-gen-index]**
**aws_sns_topic.update_topic: Refreshing state... [id=arn:aws:sns:us-east-1:385198630581:s3pypi-updates]**
**aws_lambda_permission.gen_index_from_sns: Refreshing state... [id=terraform-20190831224440607800000004]**
**aws_iam_role_policy_attachment.gen_index_s3_access: Refreshing state... [id=s3pypi-gen-index-20190831224431617700000003]**
**aws_s3_bucket_notification.artifact_notification: Refreshing state... [id=s3pypi-artifacts]**
**aws_lambda_permission.gen_proj_index_from_sns: Refreshing state... [id=terraform-20190831224440805200000005]**

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
```diff
+    create
```

Terraform will perform the following actions:

  **# aws_iam_policy.generate_proj_index** will be created
```diff
+    resource "aws_iam_policy" "generate_proj_index" {
+        arn    = (known after apply)
+        id     = (known after apply)
+        name   = "s3pypi-generate-proj-index"
+        path   = "/"
+        policy = jsonencode(
```
            {
```diff
+                Statement = [
+                    {
+                        Action   = [
+                            "s3:HeadBucket",
+                            "s3:ListObjects",
```
                        ]
```diff
+                        Effect   = "Allow"
+                        Resource = [
+                            "arn:aws:s3:::s3pypi-artifacts",
```
                        ]
```diff
+                        Sid      = ""
```
                    },
```diff
+                    {
+                        Action   = "s3:*"
+                        Effect   = "Allow"
+                        Resource = [
+                            "arn:aws:s3:::s3pypi-index/*/index.html",
```
                        ]
```diff
+                        Sid      = ""
```
                    },
```diff
+                    {
+                        Action   = "SNS:Publish"
+                        Effect   = "Allow"
+                        Resource = "arn:aws:sns:us-east-1:385198630581:s3pypi-rebuild-root"
+                        Sid      = ""
```
                    },
                ]
```diff
+                Version   = "2012-10-17"
```
            }
        )
    }

  **# aws_iam_role_policy_attachment.gen_proj_index_s3_access** will be created
```diff
+    resource "aws_iam_role_policy_attachment" "gen_proj_index_s3_access" {
+        id         = (known after apply)
+        policy_arn = (known after apply)
+        role       = "s3pypi-gen-proj-index"
```
    }

**Plan:** 2 to add, 0 to change, 0 to destroy.
